org/articles/Haskell/2014-10-05-start.org
#+BEGIN_HTML
---
date: 2014-10-05 22:02:03
template: tech.jade
title: 开始学习Haskell
category: Haskell
chage_frequency: monthly
tag: haskell
---
#+END_HTML

** why Haskell
决定要学习一门函数式编程语言，希望能纯粹函数式，于是选择了Haskell，因为它的几个理念让我喜欢：\\
1. 纯函数式
2. IO / 非IO 做明显区分
3. 有学术背景
4. 历史悠久，相对成熟
5. 性能可观，ghc编译器优秀

这几点有别于其它函数式语言或者具有函数式编程的“杂烩”型语言，因为我主要的目的是学习函数式编程的特点、优势、思维方式。

函数式编程给我的感觉是带点数学的学术味道，于是也有一些理论的研究用在了语言之中，可以把函数式语言算作是一种数学理论的现实实现吧。这方面我比较认识肤浅，也比较有兴趣去了解和发掘。

** 学习顺序
我的学习顺序是这样的：
1. 阅读Haskell官网的概要性文章，如：why functional programming ?\\
   从整体上了解和认识函数式编程，包括优势、劣势，使用领域，成功案例等等。
2. 找一本全面深入的电子书，开始细致的学习，我选择了“RealWorld Haskell"\\
   主要是希望能从0开始，全面掌握一些基础概念，打好基础。
3. 找一些实际项目或者实践性的书，学习实际应用，加深对基础的理解和熟练运用
4. 有意识地在日常工作中使用
5. 深入了解语言背后实现：
   1. 内存分配管理和垃圾回收
   2. ghc编译器编译处理的过程
   3. 知晓执行效率等内在问题
** 时间安排
   + 每天学习一章
   + 45天内学习完成基础部分
   + 90天内能够熟练运用和加深理解
   + 120天内能对语言本身的实现有了解 
