wintersmith/contents/articles/Haskell/2014-10-05-start.html
---
date: 2014-10-05 22:02:03
template: tech.jade
title: 开始学习Haskell
category: Haskell
chage_frequency: monthly
tag: haskell
---


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">why Haskell</a></li>
<li><a href="#sec-2">学习顺序</a></li>
<li><a href="#sec-3">时间安排</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-3">
<h3 id="sec-1">why Haskell</h3>
<div class="outline-text-3" id="text-1">

<p>决定要学习一门函数式编程语言，希望能纯粹函数式，于是选择了Haskell，因为它的几个理念让我喜欢：<br/>
</p><ol>
<li>纯函数式
</li>
<li>IO / 非IO 做明显区分
</li>
<li>有学术背景
</li>
<li>历史悠久，相对成熟
</li>
<li>性能可观，ghc编译器优秀
</li>
</ol>


<p>
这几点有别于其它函数式语言或者具有函数式编程的“杂烩”型语言，因为我主要的目的是学习函数式编程的特点、优势、思维方式。
</p>
<p>
函数式编程给我的感觉是带点数学的学术味道，于是也有一些理论的研究用在了语言之中，可以把函数式语言算作是一种数学理论的现实实现吧。这方面我比较认识肤浅，也比较有兴趣去了解和发掘。
</p>
</div>

</div>

<div id="outline-container-2" class="outline-3">
<h3 id="sec-2">学习顺序</h3>
<div class="outline-text-3" id="text-2">

<p>我的学习顺序是这样的：
</p><ol>
<li>阅读Haskell官网的概要性文章，如：why functional programming ?<br/>
   从整体上了解和认识函数式编程，包括优势、劣势，使用领域，成功案例等等。
</li>
<li>找一本全面深入的电子书，开始细致的学习，我选择了“RealWorld Haskell"<br/>
   主要是希望能从0开始，全面掌握一些基础概念，打好基础。
</li>
<li>找一些实际项目或者实践性的书，学习实际应用，加深对基础的理解和熟练运用
</li>
<li>有意识地在日常工作中使用
</li>
<li>深入了解语言背后实现：
<ol>
<li>内存分配管理和垃圾回收
</li>
<li>ghc编译器编译处理的过程
</li>
<li>知晓执行效率等内在问题
</li>
</ol>

</li>
</ol>

</div>

</div>

<div id="outline-container-3" class="outline-3">
<h3 id="sec-3">时间安排</h3>
<div class="outline-text-3" id="text-3">

<ul>
<li>每天学习一章
</li>
<li>45天内学习完成基础部分
</li>
<li>90天内能够熟练运用和加深理解
</li>
<li>120天内能对语言本身的实现有了解 
</li>
</ul>

</div>
</div>
